import figmaLogo from "@docs/assets/root/Figma.svg";
import gitlabLogo from "@docs/assets/root/Gitlab.svg";

export const rootText = {
  main: {
    title: "Alabuga UI",
    description:
      "Дизайн‑система объединяющая стандарты визуальной коммуникации бренда: гайдлайны, компоненты и правила использования для дизайнеров и разработчиков.",
  },
  components: {
    title: "80+ компонентов ",
    description:
      "Готовые элементы интерфейса для повседневных сценариев — от кнопок и форм до таблиц, графиков и навигации. Все компоненты адаптивны и соответствуют единым правилам системы.",
  },
  patterns: {
    title: "Паттерны",
    description:
      "Проверенные сценарии и готовые структуры экранов для решения комплексных задач. Паттерны помогают быстрее проектировать понятные и последовательные пользовательские интерфейсы.",
  },
  themizer: {
    title: "Темизатор",
    description:
      "Дизайн-система alabuga UI содержит 2 темы, основанные на двуслойной цветовой модели. Механизм темизации спроектирован для гибкой настройки цвета и поддержки айдентики брендов с разным набором требований",
  },
  icons: {
    title: "2000+ иконок",
    description:
      "Единая библиотека иконок для интерфейсов, коммуникаций и различных продуктовых сценариев. Все иконки выполнены в общем стиле и доступны для использования в дизайне и разработке.",
  },
  connection: {
    title: "Подключение пакета",
    description:
      "Установите пакет через удобный менеджер зависимостей и подключите его к проекту. Компоненты, стили и дизайн-токены сразу станут доступны для использования в приложении.",
  },
  other: {
    title: "Токены и темы",
    description:
      "Цвета, типографика, отступы и другие параметры собраны в единую систему и синхронизированы между дизайном и кодом. Токены упрощают настройку интерфейса и позволяют быстро переключаться между темами.",
  },
};

export const resourceLinks = [
  {
    title: "Для дизайнеров",
    description: "Переходите в нашу Figma",
    href: "https://www.figma.com/design/gPjMJwL1jc8V4G6x4lZJDa/",
    logo: figmaLogo,
  },
  {
    title: "Для разработчиков",
    description: "Исходная дизайн-система в GitLab",
    href: "https://gitlab.alabuga.space/ssr/tribes/tribe-2/design-system/ui-lib/-/tree/redesign",
    logo: gitlabLogo,
  },
] as const;
